[{"dec":"Termux – Clear Screen\n\nTo clear all screen content run the clear command.","title":"clear"},{"dec":"Termux – Current Working Directory\n\nThis command will tell you, your current working directory","title":"pwd"},{"dec":"Termux – Changing Directory\n\ncd command uses to change our current working directory to another directory, type cd, and your directory name. Im moving in /home directory.","title":"cd/home"},{"dec":"Termux – Move Back Directory\n\nIf you want one directory to move back by using cd .. you can easily back one directory. and you wanna back two directories use the cd ../../ command.","title":"cd..cd/../"},{"dec":"Termux – Create New File\n\nby using the touch command we can easily create a file","title":"touch<fileName>"},{"dec":"Termux – Create New Directory\n\nMkdir Stands for creating a new directory. Lets Type the mkdir command and give a directory and using a space gape and hit the enter button.","title":"mkdir <new-directory-name>"},{"dec":"delete any directory by using the command, just type the rmdir <delete directory-name> and press enter and it will be deleted. delete the directory and their contents recursively rm -r < directory-name >","title":"rm <file-name>"},{"dec":"delete any file type the rm <your-filename> and press enter and it will be deleted within a second.","title":"mv <old-filename> <new-overwirte-filename>\n\nmv -r <currnet-file-location> <your-new-destination-directory>"},{"dec":"Termux – Rename File and Directory and Move a File\n\nThe mv command is a Linux command-line utility that moves files or directories from one place to another. rename filename type the command mv <old-filename> <new-filename>","title":"cp <filename> <new-filename>\ncp -r <directory-name> <new-directory-name>"},{"dec":"Termux – Copy File and Directory\n\ncopy file source to destination. this is another Linux command-line utility for copy files and directories. if you want to copy a directory you must use cp -r copy directories and their contents recursively.","title":"vi <filename>\n\nnano <filename>"},{"dec":"Termux – Read File Content cat command\n\nRun the cat command using extra argument <your-read-file-name> and everything is seen in the terminal inside the text file.","title":"cat <filename>"},{"dec":"Termux – All running background Process Top command\n\nKnow all running processes in Termux you can easily see all running processes by using the top command.","title":"top"},{"dec":"Termux – Change Permission and Group\n\nyou can easily change every file permission and change file ownership group and user. for adding execute permission to run the command. ( chmod +x <file-name> ) if you want to change file ownership run the command ( chown newuser:newgroup <filename>.","title":"chmod (permission-mode) <filename>\nchown (newuser:newgroup) <filename>"},{"dec":"Termux – Clone Source code from Github\n\nDownload new project and cloning project from git hub run the command.","title":"git clone <cloning url>"},{"dec":"Termux – Download File wget and curl\n\nIf you want to download the file through the terminal. there are many download tools but we are mostly using these tools. wget and curl you can download every file from the internet by using those tools.","title":"wget <download-file-url>\ncurl <download-file-url> -o <output-filename>"},{"dec":"Termux – history All Previous run Command\n\nchecking all previously run commands","title":"history"},{"dec":"The command will display a list of all installed packages including the versions of the packages.","title":"dpkg --list"},{"dec":"Install New Package\n\ninstalling a new package let’s try one example install python3. run the command < pkg install python3 > and you see a promote type y for yes and your package is installed soon. it depends on your internet speed.","title":"pkg install <package-name>"},{"dec":"Remove Installed Package\n\nyou can uninstall any package from the list, just type pkg remove and <remove-package-name>.it will ask you. if you wanna delete the package press y or not n After type y the package will be removed automatically.","title":"pkg remove <remove-package-name>"},{"dec":"","title":"apt update -y\n apt upgrade -y"},{"dec":"By using this command we can update our all installed packages","title":"uname -a"},{"dec":"Update New added Package mirrors\n\nIf you add a new repository in your source.list file. before installing a new package you just need to run the apt update command.","title":"whois domain.com"},{"dec":"Display kernel information","title":"netstat -tnlp"},{"dec":"Get whois information of the domain through Termux.","title":"ifconfig"},{"dec":"Check Active Port in Termux","title":"which filename"},{"dec":"Check all network interfaces or assigned IP, mac addresses in Termux","title":"locate filename"},{"dec":"Show PCI devices","title":"lspci"},{"dec":"Send a ping packet to the target in termux","title":"ping ip,domain"},{"dec":"Connect to SSH Server in Termux Terminal","title":"ssh username@ip"},{"dec":"Connect to FTP Server in Termux Terminal","title":"ftp ip-address"}]